---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCCantUpdateLinkedFile
source: html/2802ee0b-6ad3-3752-9323-1bb88c999f54.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCCantUpdateLinkedFile Property

The cached version of this IFC file is already loaded into another document in this session, and can't be updated. To update the IFC file, please close all other documents containing the link, and then update.

## Syntax (C#)
```csharp
public static FailureDefinitionId IFCCantUpdateLinkedFile { get; }
```